IDEA StatiCa Open Model
TypeDuration Enumeration
Compatible with IDEA StatiCa Beta 21.0 - beta
 Duration of load case
 Namespace: IdeaRS.OpenModel.Loading
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public enum TypeDuration
Public Enumeration TypeDuration
public enum class TypeDuration
Members
Member name | Value | Description
LongTerm | 0 |  Long term
MediumTerm | 1 |  Medium term
ShortTerm | 2 |  Short term
InstantaneousTerm | 3 |  Instantaneous term
See Also
Reference
IdeaRS.OpenModel.Loading Namespace